tap "homebrew/cask"
tap "caskroom/fonts"
tap "hashicorp/tap"

cask_args appdir: "/Applications"

brew "mas"
brew "svn"
cask "font-source-code-pro"
cask "font-sauce-code-pro-nerd-font"

cask "alacritty"
cask "amethyst"
cask "pock"
cask "meetingbar"

brew "coreutils"
brew "diffutils"
brew "findutils"
brew "ed"
brew "gawk"
brew "gnu-sed"
brew "gnu-which"
brew "grep"
brew "less"
brew "m4"
brew "make"
brew "pstree"

brew "gzip"
brew "gnu-tar"
brew "unzip"

brew "bash"
brew "bash-completion"
brew "tmux"
brew "starship"

brew "nano"
brew "vim"
brew "lnav"

brew "git"
brew "git-delta"
brew "gh"
brew "gpg2"

cask "balenaetcher"
cask "kap"
cask "lepton"

brew "jq"
brew "bat"
brew "eza"
brew "ripgrep"
brew "fd"
brew "htop"
brew "procs"
brew "fzf"

brew "bats"
brew "shellcheck"
brew "shfmt"
brew "hadolint"

cask "docker"
cask "multipass"
brew "go"
brew "node"

brew "redis"
brew "mysql"
brew "postgresql"

cask "aptible"
brew "awscli"
cask "aws-vault"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/packer"
brew "travis"
brew "chamber"

brew "chruby"
brew "ruby-install"
brew "nvm"
brew "pipx"

cask "little-snitch"
cask "slack"
cask "zoom"
cask "encryptme"

# mas can only reinstall once added to account
mas "1Password", id: 1333542190
mas "Hidden Bar", id: 1452453066
mas "Microsoft Remote Desktop", id: 1295203466
